Repository: Igornord/enigma2-plugins-sh4
Catalog: kiddytimer/po/*.po
Languages: nl

source: Sunday
nl: Zondag

source: Monday
nl: Maandag

source: Tuesday
nl: Dinsdag

source: Wednesday
nl: Woensdag

source: Thursday
nl: Donderdag

source: Friday
nl: Vrijdag

source: Saturday
nl: Zaterdag

source: Cheat attempt detected. Box has not been shudown correctly. Remaining time was set to 0.
nl: Fraude poging gedetecteerd. De Box is niet op de juiste manier uitgezet. Verblijvende tijd is naa 0 gezet.

source: Do you want to start the kiddytimer- plugin now.
nl: Wil je de KiddyTimer- plugin nu starten.

source: Please enter the correct pin code
nl: Voer aub de juiste pin code in

source: Enter pin code
nl: Voer pin code in

source: Stop KiddyTimer (this session only)
nl: Stop de KiddyTimer (alleen deze sessie)

source: Increase remaining time
nl: Verhoog resterende tijd

source: Decrease remaining time
nl: Verminder resterende tijd

source: Set remaining time
nl: Stel resterende tijd in

source: Reset todays remaining time
nl: Reset de resterende tijd van vandaag

source: Enable KiddyTimer for x minutes
nl: Schakel de KiddyTimer in voor x minuten

source: Disable KiddyTimer
nl: Schakel KiddyTimer uit

source: Enable KiddyTimer
nl: Schakel KiddyTimer in

source: Please select your KiddyTimer- option
nl: Selecteer aub je uw KiddyTimer-optie

source: Invalid selection
nl: Ongeldige selectie

source: Enabled
nl: Ingeschakeld

source: Don't monitor TV started before
nl: Monitor de TV niet voor

source: Don't monitor TV started after
nl: Monitor de TV niet na

source: Style of timer
nl: Timer stijl

source: Timeout for activation dialog
nl: Timeout voor activatie dialoog

source: Plugin: %(plugin)s , Version: %(version)s
nl: Plugin: %(plugin)s , Versie: %(versie)s

source: Remaining time: %s
nl: Resterende tijd: &s

source: Last day started: %s
nl: Laatste dag gestart: %s

source: Cancel
nl: Annuleer

source: Save
nl: Opslaan

source: Reset clock
nl: Reset klok

source: Move clock
nl: Verplaats klok

source: The pin code you entered is wrong.
nl: De ingevoerde pin code was onjuist.

source: Save values and close screen
nl: Waarden opslaan en scherm sluiten

source: Discard changes and close screen
nl: Veranderingen ongedaan maken en scherm sluiten

source: Move screen to the left
nl: Verplaats scherm naar links

source: Move screen to the right
nl: Verplaats scherm naar rechts

source: Move screen up
nl: Verplaats scherm omhoog

source: Move screen down
nl: Verplaats scherm omlaag

source: Move screen to the upper left corner
nl: Verplaats scherm naar linker bovenhoek

source: Center screen at the upper border
nl: Centreer scherm in de bovenste rand

source: Move screen to the upper right corner
nl: Verplaats scherm naar rechter bovenhoek

source: Move screen to the middle of the left border
nl: Verplaats scherm naar het midden van de linker rand

source: Move screen to the center of your TV
nl: Verplaats scherm naar het midden van uw TV

source: Move screen to the middle of the right border
nl: Verplaats scherm naar het midden van de rechter rand

source: Move screen to the lower left corner
nl: Verplaat scherm naar linker onderhoek

source: Center screen at the lower border
nl: Centreer scherm in de onderste rand

source: Move screen to the lower right corner
nl: Verplaats scherm naar de rechter onderhoek

source: Reset saved position
nl: Reset opgeslagen positie

source: Clock
nl: Klok

source: Allows to controls your kids' daily TV usage
nl: Laat u het dagelijkse TV-gebruik van uw kinderen controleren
