Repository: Igornord/enigma2-plugins-sh4
Catalog: automatictimerlistcleanup/po/*.po
Languages: sv

source: disabled
sv: Avstängd

source: immediately after recording
sv: Direkt efter inspelning

source: older than 1 day
sv: Äldre än 1 dag

source: older than 3 days
sv: Äldre än 3 dagar

source: older than 1 week
sv: Äldre än 1 vecka

source: older than 2 weeks
sv: Äldre än 2 veckor

source: older than 4 weeks
sv: Äldre än 4 veckor

source: older than 6 weeks
sv: Äldre än 6 veckor

source: Automatic Timerlist Cleanup Setup
sv: Inställningar för automatisk upprensning

source: Cancel
sv: Avbrot

source: Cleanup timerlist-entries
sv: Städa upp timerlistans poster
