Repository: Igornord/enigma2-plugins-sh4
Catalog: extrachannelselection/po/*.po
Languages: de, ru, uk

source: Choose a color for the remaining time for event in the double-row list of channels. No restart required.
ru: Выберите цвет для оставшегося времени в двухрядном списке каналов. Применяется без перезагрузки.

source: Choose a color for the remaining time for event in the double-row list of channels, when it selected. No restart required.
ru: Выберите цвет для оставшегося времени в двухрядном списке каналов на выбранной строчке. Применяется без перезагрузки.

source: Selective yellow
ru: Отборный желтый

source: only Infobars
ru: Только инфобары

source: all windows
ru: Все окна

source: disable
ru: Отключить

source: Specify whether to turn on the smoothly show only infobars or all the windows or disable this function. Restart required.
ru: Выберите тип плавного затухания и появления окон. Можно выбрать, чтобы плавно появлялись и затухали только инфобары, либо все окна имиджа. При этом затухают только инфобары. Либо можете отключить эту функцию.

source: Smooth emergence and attenuation
ru: Плавное появление и затухание

source: Enable or disable Infobar effects. Restart required.
ru: Включение или отключение эффектов Инфобаров. Требуется перезагрузка

source: Specify whether to turn on the smoothly show only infobars or all the windows. Or you can choose other types of effects. Restart required.
ru: Выберите тип эффектов Инфобаров. Если выберите вариант со всеми окнами, все окна имиджа будут появляться плавно, а затухание будет только у инфобаров. При выборе смешанного типа, первый инфобар будет появляться снизу и исчезать вниз, второй инфобар будет затухать. Требуется перезагрузка.

source: Enable Infobar Effects
ru: Включить эффекты инфобара

source: Effect types
ru: Типы эффектов

source: Smoothly show and hide
ru: Плавное появление и затухание

source: All windows smoothly show
ru: Плавное появление всех окон

source: Uprise from the bottom
ru: Появление снизу и исчезание вниз

source: Mixed type
ru: Смешанный тип

source: Backup
ru: Бекап

source: Backup settings for current skin
ru: Бекап для текущего скина

source: Current skin - %s
ru: Текущий скин - %s

source: Press OK for action
ru: Нажмите ОК для применения

source: Save settings for current skin
ru: Сохранить настройки для текущего скина

source: Restore settings for current skin
ru: Восстановить настройки для текущего скина

source: Backup file is already exists! Do you want rewrite backup file?
ru: Файл бекапа уже существует! Хотите перезаписать его?

source: Settings successfully saved!
ru: Настройки успешно сохранены!

source: Backup file not exists!
ru: Файл бекапа не найден!

source: Do not be afraid, now image will be stopped and restarted for the restore the settings of ExtraChannelSelection for the current skin. Restore settings?
ru: Не пугайтесь, сейчас ваш имидж будет остановлен и перезапущен для восстановления настроек плагина для текущего скина. Восстановить настройки?

source: Short progress-bar
ru: Короткий бар

source: Long progress-bar
ru: Длинный бар

source: Big channelline
ru: Крупные пиконы

source: Choose a type of the doubleline channellist.
ru: Выберите тип двухрядного списка каналов. Вариант -Крупные пиконы- означает большую ширину строки для двухрядного канала.

source: Doubleline channellist type
ru: Тип двухрядного списка каналов

source: When enabled, the long progress-bar will be with a border. No restart required.
ru: Если включено, длинный прогресс-бар будет с бордюром. Применяется без перезагрузки.

source: Long bar with border
ru: Длинный прогрессбар с бордюром

source: Configure the location of icons - at the beginning on channellist or after the ServiceName. And you can choose - without icon. No restart required.
ru: Выберите местоположение иконок типа сервиса (спутниковый, наземный...) - в начале строчки, после названия канала или можете отключить показ иконок. Применяется без перезагрузки.

source: Doubleline with big picons
ru: Применить крупные пиконы
