Repository: Igornord/enigma2-plugins-sh4
Catalog: extrachannelselection/po/*.po
Languages: de, ru, uk

source: Settings of service list on channel selection
de: Einstellungen der Serviceliste für Kanalauswahl
ru: Добавляем проценты в список каналов
uk: Налаштування списку каналів на Ваш смак

source: ExtraChannelSelection - Version: %s
ru: Меняем селектор каналов - Версия: %s
uk: Екстра селектор каналів - Версія: %s

source: ExtraChannelSelection settings
de: ExtraChannelSelection Einstellungen
ru: Настройки экстра-списка каналов
uk: Налаштування екстра-списку каналів

source: ExtraChannelSelection Enabled
de: ExtraChannelSelection Eingeschaltet
ru: Включить плагин
uk: Увімкнути плугін

source: ProgressBar Type
de: ProgressBar Typ
ru: Настройки ПрогрессБара
uk: Налаштування Прогрес-Бару

source: Eventview type
de: Eventview Typ
ru: Настройки события
uk: Налаштування подій

source: Percent Type
de: Prozent Typ
ru: Тип показа процентов
uk: Спосіб показу відсотків

source: Without ProgressBar
de: Ohne ProgressBar
ru: Отключить ПрогрессБар
uk: Вимкнути ПрогресБар

source: Dark blue pixmap
de: Dunkelblau pixmap
ru: Темно-синий Бар
uk: Темно-синій Бар

source: Dark green pixmap
de: Dunkelgrün Бар
ru: Зеленый Бар
uk: Зелений Бар

source: Red pixmap
de: Rot pixmap
ru: Вишневый Бар
uk: Темно-червоний Бар

source: Striped blue pixmap
de: Gestreiftes Blau
ru: Синеватый Бар
uk: Синiй Бар

source: Bright yellow pixmap
de: Leuchtend gelbe
ru: Ярко-желтый Бар
uk: Яскраво-жовтий Бар

source: Black pixmap
de: Schwarz pixmap
ru: Черный Бар
uk: Чорний Бар

source: Light blue pixmap
de: Hellblau
ru: Светло-голубой Бар
uk: Яскраво-голубий Бар

source: Varicoloured pixmap
de: Mehrfarbiges pixmap
ru: Разноцветный Бар
uk: Різно-кольоровий Бар

source: Versicolor pixmap
de: Vielfarbiges pixmap
ru: Полосатый Бар
uk: Смугасний Бар

source: Dark yellow pixmap
de: Dunkelgelb pixmap
ru: Оранжевый Бар
uk: Помаранчевий Бар

source: Light green pixmap
de: Hellgrün pixmap
ru: Светло-зеленый Бар
uk: Яскраво-зелений Бар

source: Without Percent
de: Ohne Prozent
ru: Отключить проценты
uk: Вимкнути відсотки

source: Percent without brackets
de: Prozent ohne Klammern
ru: Проценты без скобок
uk: Відсотки без дужок

source: Percent in brackets
de: Prozent mit Klammern
ru: Проценты в скобках
uk: Відсотки у дужках

source: Event without brackets
de: Event ohne Klammern
ru: Событие без скобок
uk: Подія без дужок

source: Event in brackets
de: Event in Klammern
ru: Событие в скобках
uk: Подія в дужках

source: Event through a dash
de: Event mit einen Bindestrich
ru: Событие через тире
uk: Подія через тире

source: ExtraChannelSelectionSetup
ru: Плагин ExtraChannelSelection
uk: ExtraChannelSelection плугін

source: Author: a.k.a. Uchkun (c)
de: a.k.a. Учкун (c) 2013
ru: a.k.a. Учкун (c) 2013
uk: Author: a.k.a. Uchkun @ ua - slavon (Львів, Бандерштат, Україна)

source: on left
de: links
ru: Слева
uk: Ліворуч

source: on right
de: Rechts
ru: Справа
uk: Праворуч

source: Enable double-click OK
de: Aktivieren mit Doppelklick auf OK
ru: Включить двойное нажатие ОК
uk: Увімкнути подвійне натискання кнопки ОК

source: The text in the absence of an event
de: Text anzeigen ohne EPG
ru: Показать текст об отсутствии ЕПГ
uk: Показувати повідомлення про відсутність ЕПГ

source: Show picon
de: Picons Anzeigen
ru: Включить показ пиконов
uk: Увімкнути відображення піконів

source: Picon location
de: Picon Position
ru: Расположение пиконов
uk: Розташування піконів

source: Doubleline channellist
de: Zweireihige Liste der Kanäle
ru: Двухрядный список каналов
uk: Дворядковий список каналів

source: Color for this text
de: Textcolor ohne EPG
ru: Цвет текста об отсутствии ЕПГ
uk: Колір повідомлення про відсутність ЕПГ

source: Orange
ru: Оранжевый
uk: Помаранчевий

source: Denim color
ru: Джинсовый
uk: Джинсовий

source: Gray
de: Grau
ru: Серый
uk: Сірий

source: Dark slate gray
de: Dunkles Schiefergrau
ru: Темно-серый
uk: Темно-сірий

source: Blue-green
de: Blaugrün
ru: Сине-зеленый
uk: Синє-зелений

source: Cyan
ru: Голубой
uk: Блакитний

source: Midnight blue
de: Nachtblau
ru: Темно-синий
uk: Темно-синій

source: Steel Blue
de: Stahlblau
ru: Цвет синей стали
uk: Колір синьої сталі

source: Green
de: Grün
ru: Зеленый
uk: Зелений

source: Silver
de: Silber
ru: Серебристый
uk: Срібний

source: Aquamarine
de: Aquamarin
ru: Цвет морской волны
uk: Колір морської хвилі

source: Yellow
de: Gelb
ru: Желтый
uk: Жовтий

source: Red
de: Rot
ru: Красный
uk: Червоний

source: Purple
de: Purpur
ru: Фиолетовый
uk: Фіолетовий

source: White
de: Weiß
ru: Белый
uk: Білий

source: Blue
de: Blau
ru: Синий
uk: Синій

source: Saddle Brown
de: Braun
ru: Коричневый
uk: Коричневий

source: Crimson
de: Karmesinrot
ru: Малиновый
uk: Малиновий

source: Dim Gray
de: Dunkel Grau
ru: Темно-серый
uk: Темно-серій

source: Tan
de: Gelbbraun
ru: Хаки
uk: Хакі

source: Sea green
de: See grün
ru: Морской зеленый
uk: Морский зелений

source: Pink
ru: Розовый
uk: Розовий

source: Medium orchid
de: Orchidee
ru: Цвет орхидеи
uk: Колір орхидеї

source: Indian red
de: Indisches Rot
ru: Каштановый
uk: Каштановий

source: Antique white
de: Antik weiß
ru: Античный белый
uk: Античний білий

source: Light green
de: Hellgrün
ru: Светло-зеленый
uk: Яскраво-зелений

source: Indigo
ru: Индиго
uk: Індиго

source: Dark Green
de: Dunkelgrün
ru: Темно-зеленый
uk: Темно-зелений

source: Dark olive
de: Dunkeloliv
ru: Темно-оливковый
uk: Темно-оливковий

source: Color from skin
de: Farbe aus dem skin
ru: Цвет из скина
uk: Колір зі скіну

source: ProgressBar with color
de: ProgressBar mit Farbe
ru: Цветной Бар
uk: Кольоровий Бар

source: ProgressBar with pixmap
de: ProgressBar mit pixmap
ru: Бар с картинкой
uk: Бар з малюнком

source: Pixmap from skin
de: Pixmap aus dem skin
ru: Картинка из скина
uk: Малюнок зі скіну

source: Color for Bar
de: Farbe für Bar
ru: Цвет прогрессбара
uk: Колір прогресбару

source: Color for selected Bar
de: Farbe für ausgewählte Bar
ru: Цвет прогрессбара при выборе
uk: Колір прогресбару при виборі

source: Pixmap for Bar
de: Pixmap für Bar
ru: Цвет картинки прогрессбара
uk: Колір малюнку прогресбару

source: Color for selected BarBorder
de: Farbe für ausgewählte BarRand
ru: Цвет граней Бара при выборе
uk: Колір граней Бару при виборі

source: Color for BarBorder
de: Farbe für BarRand
ru: Цвет граней Бара
uk: Колір граней Бару

source: Color for Satlist
de: Farbe für Satliste
ru: Цвет списка спутников
uk: Колір списку спутників

source: Color for selected Satlist
de: Farbe für ausgewählte Satliste
ru: Цвет списка спутников при выборе
uk: Колір списку спутників при виборі

source: Colors of elements from a skin
de: Frabe für skin elemente
ru: Цвет элементов из скина
uk: Колір елементів зі скіну

source: Color for number
de: Farbe für Kanalnummer
ru: Цвет номера канала
uk: Колір номеру каналу

source: Color for number when selected
de: Farbe für ausgewählte Kanalnummer
ru: Цвет номера канала при выборе
uk: Колір номеру каналу при виборі

source: Color for Service Name
de: Farbe für Service Name
ru: Цвет названия канала
uk: Колір назви каналу

source: Color for Service Name when selected
de: Farbe für ausgewählte Service Name
ru: Цвет названия канала при выборе
uk: Колір назви каналу при виборі

source: Color for percent
de: Farbe für Prozent
ru: Цвет процентов
uk: Колір відсотків

source: Color for percent when selected
de: Farbe für ausgewählte Prozent
ru: Цвет процентов при выборе
uk: Колір відсотків при виборі

source: Color for event
de: Farbe für Event
ru: Цвет названия передачи
uk: Колір назви передачі

source: Color for event when selected
de: Farbe für ausgewählte Event
ru: Цвет названия передачи при выборе
uk: Колір назви передачі при виборі

source: Start-end Color
de: Farbe für Start und Ende
ru: Цвет начала-окончания
uk: Колір початку-закінчення

source: Start-end Color when selected
de: Farbe für ausgewählte Sart und Ende
ru: Цвет начала-окончания при выборе
uk: Колір початку-закінчення при выборі

source: Color for remaining time
de: Farbe für verbleibende Zeit
ru: Цвет оставшегося времени
uk: Колір часу що залишився

source: Color for remaining time when selected
de: Farbauswahl - verbleibende Zeit
ru: Цвет оставшегося времени при выборе
uk: Колір часу що залишився при виборі

source: only minutes
de: in Minuten
ru: В минутах
uk: У хвилинах

source: hours and minutes
de: Stunden und Minuten
ru: Часы и минуты
uk: Години та хвилини

source: Bar on left
de: ProgressBar Links
ru: Прогрессбар слева
uk: Прогресбар ліворуч

source: Bar on right
de: ProgressBar Rechts
ru: Прогрессбар справа
uk: Прогресбар праворуч

source: Percent on left
de: Prozent Links
ru: Проценты слева
uk: Відсотки ліворуч

source: Percent on right
de: Prozent Rechts
ru: Процент справа
uk: Відсотки праворуч

source: Without Bar
de: Ohne ProgressBar
ru: Отключить прогрессбар
uk: Вимкнути прогресбар

source: Bar or percent position
de: ProgressBar oder Prozent position
ru: Позиция Бара и процентов
uk: Розташування Бару та відсотків

source: Show channel number
de: Kanalnummer anzeigen
ru: Показать номер канала
uk: Показувати номер каналу

source: Remaining time type
de: Typ verbleibende Zeit
ru: Тип оставшегося времени
uk: Тип часу що залишився

source: Bar and percent together
de: ProgressBar und Prozent zusammen
ru: Прогрессбар и проценты вместе
uk: Бар та відсотки разом

source: Percent location
de: Prozent Position
ru: Расположение процентов
uk: Розташування відсотків

source: Font-size Number
de: Schriftgröße für Kanalnummer
ru: Размер шрифта номера канала
uk: Розмір шрифту для номеру каналу

source: Font-size Service Name
de: Schriftgröße für Service Name
ru: Размер шрифта имени канала
uk: Розмір шрифту для назви каналу

source: Font-size Percent
de: Schriftgröße für Prozent
ru: Размер шрифта процентов
uk: Розмір шрифту для відсотків

source: Font-size Event
de: Schriftgröße für Event
ru: Размер шрифта названия передачи
uk: Розмір шрифту для назви передачі

source: Font-size Remain
de: Schriftgröße für Restzeit
ru: Размер шрифта оставшегося времени
uk: Розмір шрифту для часу що залишився

source: Font-size Start-End
de: Schriftgröße Start und Ende
ru: Размер шрифта начала-окончания
uk: Розмір шрифту для початку-закінчення

source: Font-size Text
de: Schriftgröße für Text
ru: Размер шрифта текста
uk: Розмір шрифту тексту

source: Font-size Sat & Prov
de: Schriftgröße für Sat und Provider
ru: Размер шрифта спутников и провайдеров
uk: Розмір шрифта супутників і провайдерів

source: Size from skin
de: Größe aus dem skin
ru: Размер из скина
uk: Розмір зі скіну

source: yes
de: ja
ru: да

source: no
de: keine
ru: нет

source: Close
de: Schließen
ru: Закрыть

source: Save
de: Speichern
ru: Сохранить

source: Change EPG window
de: Ändern EPG Fenster
ru: Изменить окно телегида
uk: Змінити вікно телегіда

source: Without remain
de: Abschalten
ru: Отключить
uk: Відключити

source: Start-end time enabled
de: Zeigen Sie Start-Ende
ru: Показать время начала-окончания
uk: Показати час початку-закінчення

source: Type of display of icons
de: Art der Anzeige von Icons
ru: Тип показа иконок
uk: Тип показу іконок

source: Without icon
de: Nicht mehr anzeigen
ru: Не показывать
uk: Не показувати

source: At the beginning
de: Anfangs
ru: В начале строки
uk: На початку рядка

source: After the servicename
de: Nach dem Namen des Kanals
ru: После названия канала
uk: Після назви каналу

source: Black
de: Schwarz
ru: Черный
uk: Чорний

source: Black light
de: Schwarzlicht
ru: Светло-черный
uk: Світло-чорний

source: Dark blue
de: Dunkelblau
ru: Темно-голубой
uk: Темно-блакитний

source: Navy blue
de: Tiefblau
ru: Темно-синий
uk: Темно-синій

source: Info
ru: Информация

source: Plugin History
ru: История плагина

source: Author: a.k.a. Uchkun (c). Special thanks to Nikolasi for saved time for the derivation of Picon. The idea of the plugin was born in autumn 2012 in the study of the source listboxservice.cpp. It has become clear that it is achievable. A designer multicontent own even novice programmers to Enigma. Purses for transfers: WebMoney Z108027892539 R325825136282
ru: Автор: ака Учкун (с) 2013. Специальная благодарность Nikolasi за сэкономленное мною время при выводе пиконов. Идея плагина родилась осенью 2012 года при изучении исходников listboxservice.cpp. Стало ясно, что это достижимо. А конструктором мультиконтент владеют даже начинающие программисты на Энигме. Кошельки для переводов (если есть желание помочь): WebMoney Z108027892539 R325825136282

source: Enable or disable the plugin. Plugin's menu is dynamic. When open any items, other items opened or closed. Restart required.
ru: Включение и отключение плагина. Меню плагина выполнено динамически раскрываемым-закрываемым. То есть в зависимости от настроек при раскрытии некоторых пунктов другие пункты раскрываются или закрываются и наоборот. Требуется перезагрузка.

source: When enabled, double tap OK in the channel list is working. First press - show channel in the PIG, the second press - close channel list. Restart required.
ru: При включении заработает двойное нажатие ОК в списке каналов. Первое нажатие - показ канала в PIG-окне, второе нажатие - закрытие списка каналов. Требуется перезагрузка.

source: When enabled, if EPG from TV Guide is not available, will be shown static text - 'No EPG data available'. No restart required.
ru: Если включено, при отсутствии информации от телегида вместо ЕПГ будет показан статический текст - 'Информация телегида отсутствует'. Применяется без перезагрузки.

source: Color selection for the above text - 'No EPG data available'. No restart required.
ru: Выбор цвета для вышеуказанного текста - 'Информация телегида отсутствует'. Применяется без перезагрузки.

source: When enabled, each channel in the selector will occupy two lines with additional information, and advanced settings for double-row configuration will appear in the menu, and vice versa, settings for only single-row configuration on the channel list will disappear. Restart required.
ru: Если включено, каждый канал в селекторе будет занимать две строки с дополнительной информацией, а также в меню появятся дополнительные настройки и наоборот, настройки касающиеся только однорядного списка каналов исчезнут. Требуется перезагрузка.

source: Showing percent above the progressbar to saving space in the channel list. It is necessary to configure the location of percent and location of progressbar at one side - at the left side or at the right side for both. Location percent set in the same menu in item 'Percent location' and the progressbar in the settings of the image 'Main Menu-Settings-System-User Interface-Progressbar Type'. No restart required.
ru: Показ процентов над прогрессбаром, чтобы освободить место в списке каналов. Далее нужно будет настроить расположение и процентов и прогрессбара в одной стороне, оба слева или оба справа. Местоположение процентов настраивается в этом же меню в пункте 'Расположение процентов', а прогрессбара в настройках самого имиджа 'Главное меню-Настройки-Система-Интерфейс пользователя-Тип показа прогрессбара'. Применяется без перезагрузки.

source: Configure the location of percent - at the left or at the right side. Keep in mind, if you have included on the previous item 'Bar and percent together', then will need to put a progressbar in the same side in the settings of the image in the user interface. No restart required.
ru: Настройка местоположения процентов - слева или справа. Имейте ввиду, если включили предыдущий пункт 'Проценты и прогрессбар вместе', нужно будет и прогрессбар поставить в этой же стороне в настройках имиджа в интерфейсе пользователя. Применяется без перезагрузки.

source: Select the type of display the time remaining in the double-row list of channels. Two types, number of minutes or hours with minutes. No restart required.
ru: Выберите тип отображения оставшегося времени в двухрядном списке каналов. Либо количество минут, либо в часах и минутах. Применяется без перезагрузки.

source: When enabled, In the double-row channel list will be displayed start-time and end-time of event. No restart required.
ru: Если включено, в двухрядном списке каналов будет отображаться время начала и окончания передачи. Применяется без перезагрузки.

source: 'ProgressBar with color' means that you will need to choose the color for progressbar. At a choice of this option, be convinced that in the skin.xml a certain picture isn't applied to the cursor. 'ProgressBar with pixmap' means that you will need to choose a pixmap as a progressbar. In the version with the picture color will turn richer and brighter. No restart required.
ru: Цветной бар означает, что нужно будет выбрать цвет отображения прогрессбара. Если в текущем skin.xml применена картинка для отображения полоски под курсором, то этот вариант выбирать не стоит. Вариант бара из картинки означает, что нужно будет выбрать цветную картинку в качестве прогрессбара. В этом варианте цвета получатся насыщеннее и ярче. Применяется без перезагрузки.

source: Choose a color to the progressbar. Valid only if you select the 'ProgressBar with color'. No restart required.
ru: Выбор цвета для прогрессбара. Действует только при выборе опции 'Цветной бар'. Применяется без перезагрузки.

source: Choose a color to the progressbar, when it selected. Valid only if you select the 'ProgressBar with color'. No restart required.
ru: Выбор цвета для прогрессбара на выбранной строчке. Действует только при выборе опции 'Цветной бар'. Применяется без перезагрузки.

source: Choose a pixmap to the progressbar. Valid only if you select the 'ProgressBar with pixmap'. No restart required.
ru: Выбор цветной картинки для прогрессбара. Действует только при выборе опции 'Бар с картинкой'. Применяется без перезагрузки.

source: Choose a color to the border of progressbar, when it selected. Valid only if you select the 'ProgressBar with pixmap'. No restart required.
ru: Выбор цвета для граней прогрессбара на выбранной строчке. Действует только при выборе опции 'Бар с картинкой'. Применяется без перезагрузки.

source: Choose a color to the border of progressbar. No restart required.
ru: Выбор цвета для граней прогрессбара. Применяется без перезагрузки.

source: Choose a color to the satlist and providerlist. No restart required.
ru: Выбор цвета для списка спутников и списка провайдеров. Применяется без перезагрузки.

source: Choose a color to the satlist and providerlist, when it selected. No restart required.
ru: Выбор цвета для списка спутников и списка провайдеров на выбранной строчке. Применяется без перезагрузки.

source: Select the type of display of percent. In brackets or without brackets, or you can disable display of percent. No restart required.
ru: Выберите тип отображения процентов. В скобках или без скобок, либо можете отключить показ процентов. Применяется без перезагрузки.

source: Select the type of display the name of the event. In brackets or without brackets, or through a dash. No restart required.
ru: Выберите тип отображения названия передачи. В скобках или без скобок, либо через тире. Применяется без перезагрузки.

source: Specify whether or not to show picons in the channel list. No restart required.
ru: Укажите, показывать или не показывать пиконы в списке каналов. Применяется без перезагрузки.

source: Configure the location of picons - at the left or at the right side in the channel list. No restart required.
ru: Настройка местоположения пиконов - слева или справа в списке каналов. Применяется без перезагрузки.

source: If you choose 'yes', a plug-in will try to choose colors for elements of the list of channels from settings of the current skin. Some colors in a skin can be not set. Also there are elements for which colors in skins aren't set in general. To these cases, default colors will be applied. If you choose 'no', further will it is necessary to adjust colors for all elements. No restart required.
ru: Если выберете 'да', плагин попытается выбрать цвета для элементов списка каналов из настроек текущего скина. Некоторые цвета в скине могут быть не заданы. Также есть элементы, для которых цвета в скинах не задаются вообще. Для этих случаев будут применены дефолтные цвета. Если выберете 'нет', далее нужно будут настроить цвета для всех элементов. Применяется без перезагрузки.

source: Select a font size for the number of channel. No restart required.
ru: Выберите размер шрифта для номера канала. Применяется без перезагрузки.

source: Select a font size for the percent. No restart required.
ru: Выберите размер шрифта для процентов. Применяется без перезагрузки.

source: Select a font size for the Service Name. No restart required.
ru: Выберите размер шрифта для названия канала. Применяется без перезагрузки.

source: Select a font size for the Event. No restart required.
ru: Выберите размер шрифта для названия передачи. Применяется без перезагрузки.

source: Select a font size for the start- and end- time for event in the double-row list of channels. No restart required.
ru: Выберите размер шрифта для времени начала-окончания события в двухрядном списке каналов. Применяется без перезагрузки.

source: Select a font size for the remaining time for event in the double-row list of channels. No restart required.
ru: Выберите размер шрифта для оставшегося времени в двухрядном списке каналов. Применяется без перезагрузки.

source: Select a font size for the text - 'No EPG data available'. No restart required.
ru: Выберите размер шрифта для текста - 'Информация телегида отсутствует'. Применяется без перезагрузки.

source: Select a font size for the satlist and providerlist. No restart required.
ru: Выберите размер шрифта для списка спутников и списка провайдеров. Применяется без перезагрузки.

source: If enabled, the usual guide (Eventview) present in the image will be replaced by an extended program guide. The new TV guide with more information and more colorful. Restart required.
ru: Если включено, обычный телегид (просмотр событий), присутствующий в имидже будет заменен на расширенный телегид. Новый телегид с дополнительной информацией и более красочный. Требуется перезагрузка.

source: Choose a color for the number of channel. No restart required.
ru: Выберите цвет для номера канала. Применяется без перезагрузки.

source: Choose a color for the number of channel, when it selected. No restart required.
ru: Выберите цвет для номера канала на выбранной строчке. Применяется без перезагрузки.

source: Choose a color for the Service Name. No restart required.
ru: Выберите цвет для названия канала. Применяется без перезагрузки.

source: Choose a color for the Service Name, when it selected. No restart required.
ru: Выберите цвет для названия канала на выбранной строчке. Применяется без перезагрузки.

source: Choose a color for the percent. No restart required.
ru: Выберите цвет для процентов. Применяется без перезагрузки.

source: Choose a color for the percent, when it selected. No restart required.
ru: Выберите цвет для процентов на выбранной строчке. Применяется без перезагрузки.

source: Choose a color for the Event. No restart required.
ru: Выберите цвет для названия передачи. Применяется без перезагрузки.

source: Choose a color for the Event, when it selected. No restart required.
ru: Выберите цвет для названия передачи на выбранной строчке. Применяется без перезагрузки.

source: Choose a color for the start- and end- time for event in the double-row list of channels. No restart required.
ru: Выберите цвет для времени начала-окончания события в двухрядном списке каналов. Применяется без перезагрузки.

source: Choose a color for the start- and end- time for event in the double-row list of channels, when it selected. No restart required.
ru: Выберите цвет для времени начала-окончания события в двухрядном списке каналов на выбранной строчке. Применяется без перезагрузки.
