Repository: Igornord/enigma2-plugins-sh4
Catalog: quickbutton/po/*.po
Languages: ru

source: Assign plugin to long blue key pressed
ru: Долгое нажатие голубой кнопки

source: Assign plugin to long green key pressed
ru: Долгое нажатие зелёной кнопки

source: Assign plugin to long red key pressed
ru: Долгое нажатие красной кнопки

source: Assign plugin to long yellow key pressed
ru: Долгое нажатие жёлтой кнопки

source: Assign plugin to red key pressed
ru: Нажатие красной кнопки

source: Cancel
ru: Отменить

source: Display 4:3 content as
ru: 4:3 Изображение показать как

source: EPG List
ru: Список EPG

source: MediaPlayer
ru: Медиаплеер

source: No plugin assigned!
ru: Функция не назначена

source: Nothing
ru: Ничего

source: Plugin browser
ru: Плагин браузер

source: Plugin not found!
ru: Плагин не найден!

source: Timer
ru: Таймер

source: Unknown Error
ru: Неизвестная ошибка

source: assigned to long blue
ru: Длительное нажатие голубой кнопки

source: assigned to long green
ru: Длительное нажатие зелёной кнопки

source: assigned to long red
ru: Длительное нажатие красной кнопки

source: assigned to long yellow
ru: Длительное нажатие жёлтой кнопки

source: assigned to red
ru: Нажатие на красную

source: setup for Quickbutton
ru: Установки Quickbutton

source: switch 4:3 content display
ru: Переключить изображение на 4:3
