Repository: Igornord/enigma2-plugins-sh4
Catalog: timeronoff/po/*.po
Languages: ru

source: Wakeup
ru: Включение

source: DeepStandby
ru: Полное отключение

source: Standby/Wakeup
ru: Включение/Отключение

source: Su
ru: Вс

source: Mo
ru: Пн

source: Tu
ru: Вт

source: We
ru: Ср

source: Th
ru: Чт

source: Fr
ru: Пт

source: Sa
ru: Суб

source: Weekdays
ru: Будни

source: Weekend
ru: Выходные

source: Set time to stanby/wakeup
ru: Установка времени Включения/Отключения

source: Set current channel at wakeup
ru: Установка текущего канала при включении

source: Set mode
ru: Установка режима

source: Set time to wakeup
ru: Установка времени включения

source: Turn on second stanby timer
ru: Включить второй таймер

source: Set time to standby/deepstanby #1
ru: Установка времени ждущего режима/полного отключения #1

source: Set time to standby/deepstanby #2
ru: Установка времени ждущего режима/полного отключения #2

source: Set day of week
ru: День недели

source: Type box password, if you have it
ru: Пароль, если он установлен

source: configuration is saved
ru: конфигурация сохранена

source: set time to stanby/wakeup
ru: установка времени Включения/Отключения

source: Set wakeup volume (0-99)
ru: Громкость включения (0-99)

source: On/Off timer
ru: Таймер Включения/Отключения
